#coding=utf-8

# ***************函数的共享引用*********************
# def funs(a,b):
#     a[0] = 10
#     b["a"] = 10
#     print a,b
# # 当输入可变类型的数据时，局部赋值会影响全局的数,比如字典，列表就是可变的
#     a = [1,2,3,4,5]
#     b = {'a':1,'b':2}
#     funs(a,b)
#     print a,b


# ****************函数调用传参的四种方式*********************

def fun(a,b):
    print "a = : ",a,
    print "b = : ",b

# ****第一种传参方式
fun(1,2)

# 第二种  位置不影响
fun(b = 4, a = 3)

#第三种　列表传参　星传参
l = [5,6]
fun(*l)

# 第四种　字典传参　星星传参 位置不影响,字典的键必须是形参的名字
d = {"b":8,'a':7}
fun(**d)
